{
    "_id" : ObjectId("5f872202bbf7bc1e7bf42ad9"),
    "Title" : "Silence of the Lambs",
    "Description" : "A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.",
    "Genre" : {
            "Name" : "Thriller",
            "Description" : "Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."
    },
    "Director" : {
            "Name" : "Jonathan Demme",
            "Bio" : "Robert Jonathan Demme was an American director, producer, and screenwriter.",
            "Birth" : "1944",
            "Death" : "2017"
    },
    "ImagePath" : "silenceofthelambs.png",
    "Featured" : true
}
{
    "_id" : ObjectId("5f87a3c9bbf7bc1e7bf42adb"),
    "Title" : "Good Will Hunting",
    "Description" : "Will Hunting, a janitor at M.I.T., has a gift for mathematics, but needs help from a psychologist to find direction in his life.",
    "Genre" : {
            "Name" : "Drama",
            "Description" : "In film and television, drama is a genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone. ... These terms tend to indicate a particular setting or subject-matter, or else they qualify the otherwise serious tone of a drama with elements that encourage a broader range of moods."
    },
    "Director" : {
            "Name" : "Gus Van Sant",
            "Bio" : "Gus Van Sant was born on July 24, 1952 in Louisville, Kentucky, USA as Gus Greene Van Sant Junior.",
            "Birth" : "1952",
            "Death" : ""
    },
    "ImagePath" : "https://m.media-amazon.com/images/M/MV5BOTI0MzcxMTYtZDVkMy00NjY1LTgyMTYtZmUxN2M3NmQ2NWJhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_CR0,0,655,1000_AL_.jpg",
    "Featured" : true
}
{
    "_id" : ObjectId("5f87a974bbf7bc1e7bf42adc"),
    "Title" : "Good Will Hunting",
    "Description" : "Will Hunting, a janitor at M.I.T., has a gift for mathematics, but needs help from a psychologist to find direction in his life.",
    "Genre" : {
            "Name" : "Drama",
            "Description" : "In film and television, drama is a genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone. ... These terms tend to indicate a particular setting or subject-matter, or else they qualify the otherwise serious tone of a drama with elements that encourage a broader range of moods."
    },
    "Director" : {
            "Name" : "Gus Van Sant",
            "Bio" : "Gus Van Sant was born on July 24, 1952 in Louisville, Kentucky, USA as Gus Greene Van Sant Junior.",
            "Birth" : "1952",
            "Death" : ""
    },
    "ImagePath" : "https://m.media-amazon.com/images/M/MV5BOTI0MzcxMTYtZDVkMy00NjY1LTgyMTYtZmUxN2M3NmQ2NWJhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_CR0,0,655,1000_AL_.jpg",
    "Featured" : true
}
{
    "_id" : ObjectId("5f87a979bbf7bc1e7bf42add"),
    "Title" : "The Notebook",
    "Description" : "A poor yet passionate young man falls in love with a rich young woman, giving her a sense of freedom, but they are soon separated because of their social differences.",
    "Genre" : {
            "Name" : "Romance",
            "Description" : "Romance films or romance movies are romantic love stories recorded in visual media for broadcast in theaters and on TV that focus on passion, emotion, and the affectionate romantic involvement of the main characters and the journey that their love takes them through dating, courtship or marriage."
    },
    "Director" : {
            "Name" : "Nick Cassavetes",
            "Bio" : "Nick Cassavetes was born in New York City, the son of actress Gena Rowlands and Greek-American actor and film director John Cassavetes. As a child, he appeared in two of his father's films: Husbands (1970) and A Woman Under the Influence (1974). After spending so much of his youth surrounded by the film industry, Cassavetes initially decided he did not want to go into the field. He instead attended Syracuse University on a basketball scholarship. His athletic career was effectively ended by an injury, and he decided to rethink his aspirations, ultimately deciding to attend his parents' alma mater, the American Academy of Dramatic Arts in New York. He has appeared in the films, Face/Off (1997), The Wraith (1986), Life (1999), Class of 1999 II: The Substitute (1994), Backstreet Dreams (1990) and The Astronaut's Wife (1999), among others. He has directed several films, including John Q (2002), Alpha Dog (2006), She's So Lovely (1997), Unhook the Stars (1996), The Notebook (2004), and My Sister's Keeper (2009). He also adapted the screenplay for Blow (2001) and wrote the dialogue for the Justin Timberlake music video, \"What Goes Around... Comes Around\". In 1985, Cassavetes married Isabelle Rafalovich. They had two daughters together, Virginia Cassavetes (Virginia Sara Cassavetes) (born in 1986) and Sasha Cassavetes (born in 1988), before divorcing. He then married Heather Wahlquist (Heather \"Queenie\" Wahlquist), who has appeared in several of his films, including a small role in The Notebook (2004) as Sara, a secondary character and best friend to the female lead Allie Hamilton, portrayed by Rachel McAdams. The movie is effectively a family project, as Cassavetes's own mother, Gena Rowlands, appears as the older, married Allie Calhoun.",
            "Birth" : "1959",
            "Death" : ""
    },
    "ImagePath" : "https://m.media-amazon.com/images/M/MV5BMTk3OTM5Njg5M15BMl5BanBnXkFtZTYwMzA0ODI3._V1_.jpg",
    "Featured" : true
}
{
    "_id" : ObjectId("5f87aa0ebbf7bc1e7bf42ade"),
    "Title" : "Up",
    "Description" : "78-year-old Carl Fredricksen travels to Paradise Falls in his house equipped with balloons, inadvertently taking a young stowaway.",
    "Genre" : {
            "Name" : "Adventure",
            "Description" : "Adventure. Adventure film is a genre that revolves around the conquests and explorations of a protagonist. The purpose of the conquest can be to retrieve a person or treasure, but often the main focus is simply the pursuit of the unknown. These films generally take place in exotic locations and play on historical myths."
    },
    "Director" : {
            "Name" : "Peter Docter",
            "Bio" : "Pete Docter was born on October 9, 1968 in Bloomington, Minnesota, USA as Peter Hans Docter.",
            "Birth" : "1968",
            "Death" : ""
    },
    "ImagePath" : "https://m.media-amazon.com/images/M/MV5BMTk3NDE2NzI4NF5BMl5BanBnXkFtZTgwNzE1MzEyMTE@._V1_SY1000_CR0,0,664,1000_AL_.jpg",
    "Featured" : true
}
{
    "_id" : ObjectId("5f87aa21bbf7bc1e7bf42adf"),
    "Title" : "The Sixth Sense",
    "Description" : "A boy who communicates with spirits seeks the help of a disheartened child psychologist.",
    "Genre" : {
            "Name" : "Mystery",
            "Description" : "A mystery film is a genre of film that revolves around the solution of a problem or a crime. It focuses on the efforts of the detective, private investigator or amateur sleuth to solve the mysterious circumstances of an issue by means of clues, investigation, and clever deduction."
    },
    "Director" : {
            "Name" : "M. Night Shyamalan",
            "Bio" : "Born in Puducherry, India, and raised in the posh suburban Penn Valley area of Philadelphia, Pennsylvania, M. Night Shyamalan is a film director, screenwriter, producer, and occasional actor, known for making movies with contemporary supernatural plots. He is the son of Jayalakshmi, a Tamil obstetrician and gynecologist, and Nelliate C. Shyamalan.",
            "Birth" : "1970",
            "Death" : ""
    },
    "ImagePath" : "https://m.media-amazon.com/images/M/MV5BMWM4NTFhYjctNzUyNi00NGMwLTk3NTYtMDIyNTZmMzRlYmQyXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_.jpg",
    "Featured" : true
}
{
    "_id" : ObjectId("5f87aa34bbf7bc1e7bf42ae0"),
    "Title" : "Saving Private Ryan",
    "Description" : "Saving Private Ryan is a 1998 American epic war film directed by Steven Spielberg and written by Robert Rodat. Set during the Invasion of Normandy in World War II, the film is known for its graphic portrayal of war and for the intensity of its second scene of 23 minutes, a depiction of the Omaha Beach assault during the Normandy landings. ",
    "Genre" : {
            "Name" : "War",
            "Description" : "War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama. It has been strongly associated with the 20th century. The fateful nature of battle scenes means that war films often end with them."
    },
    "Director" : {
            "Name" : "Steven Spielberg",
            "Bio" : "One of the most influential personalities in the history of cinema, Steven Spielberg is Hollywood's best known director and one of the wealthiest filmmakers in the world. ",
            "Birth" : "1946",
            "Death" : ""
    },
    "ImagePath" : "https://m.media-amazon.com/images/M/MV5BZjhkMDM4MWItZTVjOC00ZDRhLThmYTAtM2I5NzBmNmNlMzI1XkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_SY1000_CR0,0,679,1000_AL_.jpg",
    "Featured" : true
}
{
    "_id" : ObjectId("5f87aa42bbf7bc1e7bf42ae1"),
    "Title" : "Braveheart",
    "Description" : "Scottish warrior William Wallace leads his countrymen in a rebellion to free his homeland from the tyranny of King Edward I of England.",
    "Genre" : {
            "Name" : "History",
            "Description" : "A historical film is a fiction film showing past events or set within a historical period. This extensive genre shares territory with the biopic, costume drama, heritage film, and epic film."
    },
    "Director" : {
            "Name" : "Mel Gibson",
            "Bio" : "Mel Gibson, in full Mel Columcille Gerard Gibson, (born January 3, 1956, Peekskill, New York, U.S.), American-born Australian actor who became an international star with a series of action-adventure films in the 1980s and later earned acclaim as a director and producer.",
            "Birth" : "1956",
            "Death" : ""
    },
    "ImagePath" : "https://m.media-amazon.com/images/M/MV5BMzkzMmU0YTYtOWM3My00YzBmLWI0YzctOGYyNTkwMWE5MTJkXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_SY1000_CR0,0,677,1000_AL_.jpg",
    "Featured" : true
}
{
    "_id" : ObjectId("5f87aa61bbf7bc1e7bf42ae2"),
    "Title" : "Ford v Ferrari",
    "Description" : "American car designer Carroll Shelby and driver Ken Miles battle corporate interference and the laws of physics to build a revolutionary race car for Ford in order to defeat Ferrari at the 24 Hours of Le Mans in 1966.",
    "Genre" : {
            "Name" : "Biography",
            "Description" : "A biographical film, or biopic (/ˈbaɪoʊpɪk/; abbreviation for biographical motion picture), is a film that dramatizes the life of a non-fictional or historically-based person or people. Such films show the life of a historical person and the central character's real name is used."
    },
    "Director" : {
            "Name" : "James Mangold",
            "Bio" : "An American film and television director, screenwriter and producer. ",
            "Birth" : "1963",
            "Death" : ""
    },
    "ImagePath" : "https://m.media-amazon.com/images/M/MV5BM2UwMDVmMDItM2I2Yi00NGZmLTk4ZTUtY2JjNTQ3OGQ5ZjM2XkEyXkFqcGdeQXVyMTA1OTYzOTUx._V1_SY1000_CR0,0,675,1000_AL_.jpg",
    "Featured" : true
}
{
    "_id" : ObjectId("5f87aa6fbbf7bc1e7bf42ae3"),
    "Title" : "Hacksaw Ridge",
    "Description" : "World War II American Army Medic Desmond T. Doss, who served during the Battle of Okinawa, refuses to kill people, and becomes the first man in American history to receive the Medal of Honor without firing a shot.",
    "Genre" : {
            "Name" : "Biography",
            "Description" : "A biographical film, or biopic (/ˈbaɪoʊpɪk/; abbreviation for biographical motion picture), is a film that dramatizes the life of a non-fictional or historically-based person or people. Such films show the life of a historical person and the central character's real name is used."
    },
    "Director" : {
            "Name" : "Mel Gibson",
            "Bio" : "Mel Columcille Gerard Gibson was born January 3, 1956 in Peekskill, New York, USA, as the sixth of eleven children of Hutton Gibson, a railroad brakeman, and Anne Patricia (Reilly) Gibson (who died in December of 1990). His mother was Irish, from County Longford, while his American-born father is of mostly Irish descent.",
            "Birth" : "1956",
            "Death" : ""
    },
    "ImagePath" : "https://m.media-amazon.com/images/M/MV5BMjQ1NjM3MTUxNV5BMl5BanBnXkFtZTgwMDc5MTY5OTE@._V1_SY1000_CR0,0,647,1000_AL_.jpg",
    "Featured" : true
}
{
    "_id" : ObjectId("5f87ab3dbbf7bc1e7bf42ae4"),
    "Title" : "A Beautiful Mind",
    "Description" : "After John Nash, a brilliant but asocial mathematician, accepts secret work in cryptography, his life takes a turn for the nightmarish.",
    "Genre" : {
            "Name" : "Biography",
            "Description" : "A biographical film, or biopic (/ˈbaɪoʊpɪk/; abbreviation for biographical motion picture), is a film that dramatizes the life of a non-fictional or historically-based person or people. Such films show the life of a historical person and the central character's real name is used."
    },
    "Director" : {
            "Name" : "Ron Howard",
            "Bio" : "Academy Award-winning filmmaker Ron Howard is one of this generation's most popular directors. From the critically acclaimed dramas A Beautiful Mind (2001) and Apollo 13 (1995) to the hit comedies Parenthood (1989) and Splash (1984), he has created some of Hollywood's most memorable films. ",
            "Birth" : "1954",
            "Death" : ""
    },
    "ImagePath" : "https://m.media-amazon.com/images/M/MV5BMzcwYWFkYzktZjAzNC00OGY1LWI4YTgtNzc5MzVjMDVmNjY0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_CR0,0,673,1000_AL_.jpg",
    "Featured" : true
}